// --- الجزء الأول: بنك الأسئلة (81 سؤال) ---
const questions = [
    { "q": "يفضل شراء الاسطوانات المستنسخة للبرمجيات لأنه ارخص و اجود", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "سرقة حاسوب من مركز تقنية المعلومات يعتبر جريمة الكترونية", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "سرقة الملفات من الحاسوب تعتبر جريمة حاسوب", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "كتابة تقرير لميزانية مصروفاتك الشخصية باستخدام حاسوب الشركة يعتبر جريمة حاسوب", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "ارسال رسالة بريد الكرتوني تحتوي على معلومات مضللة او كاذبة عن شخصية عامة يعتبر جريمة اصطياد الكتروني.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "من جرائم الحاسوب قيام شخص بسرقة اقراص البرامج من المكتب بجوار الحاسوب.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "عند اصابة جهازك بفيروس قم بإطفاء الجهاز لا يقاف الفيروس.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "التشفير هو احدث الطرق لقرصنة البيانات من الحاسوب.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "اعدادات الجدار الناري تحمينا من اخطار المواقع الخبيثة", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "فتح ملف مرفق لرسالة بريد إلكتروني لا يعرف مصدره قد يكون سببا للا صابة بالفيروسات.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "قيام موقع بنشر معلومات عن اداء الحكومة يعتبر جريمة حاسوب", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "زيادة حجم الملفات دليل على الاصابة بالفيروسات", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "الفيروسات يمكن ان تصيب معدات الحاسوب", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "لا تعتبر جرائم الحاسوب ذات اهمية قصوى للدولة.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "لا يلحق التشهير أي ضرر لا بالأشخاص او المؤسسات المشهر بهم.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "الجدار النار جدار فولاذي لصد محاولات الدخول للمؤسسة.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "الجدار الناري يستخدم لصد محاولات اختراق النظام", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "الجدار الناري يستخدم لحماية شبكة الحاسوب من أي محاولة اختراق", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "قيام موظف بنشر معلومات عن جودة شركته على الانترنت يعتبر جريمة حاسوب", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "لا يسبب فيروس الدودة ضرارا للملفات ، وإنما يتسبب في تعطل الشبكة وتوقفها عن العمل", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "الفيروس التنفيذي يرتبط بالملفات التطبيقية", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "فيروس الماكرو يرتبط باسطوانات الالعاب", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "الفيروس التنفيذي يصيب البرامج الخاصة ببدء التشغيل", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "فيروس الماكرو ينتقل مع البرامج التطبيقية", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "فيروس حصان طروادة ينتقل مع بامج الالعاب", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "الفيروس التنفيذي يصيب الملفات التنفيذية", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "فيروس بدء التشغيل يصيب البرامج الخاصة ببدء التشفيل ", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "توقف بعض البرمجيات المثبتة مسبقا عن العمل دليل على احتمال الاصابة بالفير وسات.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "تحديد المستخدم من خلال بصمة الاصبع اكثر دقة و امان من كلمة المرور", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "لتأمين البرمجيات يتم تطبيق مستوى صلاحية المستخدم قبل تطبيق مستوى تحديد هوية المستخدم.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "يتم تأمن البرمجيات التطبيقية باستخدام كلا من الجدار الناري و التشفير.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "امن البرمجيات هو قدرة البرمجيات على تحديد هوية الاشخاص المخول لهم استخدامها ومنع الاخرين", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "فيروس الحاسوب برنامج يمكنه التجسس على بيانتك الشخصية وارسالها للآخرين.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "يمكن ان ترفع درجة حرارة معالج الحاسوب بالفيروسات مما يسبب احتراقه.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "فيروس الحاسوب يقوم بتحوير البيانات و تشفيرها.", "options": ["صح", "خطأ"], "answer": 1 },
    { "q": "ظهور رسائل غير اعتيادية دليل على الاصابة بالفيروسات.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": " جرائم الحاسوب استخدام الذكاء الصناعي لتعديل صورة شخص ما يشكل خادش للحياء و نشرها على الانترنت.", "options": ["صح", "خطأ"], "answer": 0 },
    { "q": "البيانات المشفرة لا يمكن للمخترق الاستفادة منها لأنه؟", "options": ["لا يملك حق الدخول الى الشبكة", "لا يملك شفرة تحوير البيانات للصورة المفهومة", "لا يملك حاسوب ذو سرعة عالية", "لا شيء مما سبق"], "answer": 1 },
    { "q": "أي مما يلي يعد طرقة جيدة لتامين البيانات المرسلة عبر الشبكة؟", "options": ["وضع اجراءات التعامل مع البيانات المهمة في الشركة", "استخدام برنامج مكافحة للفيروسات", "التأكد من حفظ البيانات و تخزينها", "اعطاء الموظفين صلاحية الدخول للبيانات كل حسب مهامه"], "answer": 3 },
    { "q": "ماهي افضل طريقة لحماية البرامج و البيانات فى الحاسوب من التلف بسبب الفيروسات؟", "options": ["تشغيل شاشة التوقف", "تغيير كلمة العبور", "عدم استخدام الانترنت", "الاحتفاظ بنسج احتياطية للبرامج و البيانات المخزنة على اسطوانات خارج الحاسوب"], "answer": 3 },
    { "q": "لا يمكن لفيروسات الحاسوب الانتقال عن طريق؟", "options": ["تغيير شاشة الحاسوب", "تنزيل ملف من الانترنت", "تبادل الملفات باستخدام الاقراص", "فتح ملف مرفق رسالة بريد الكترونى"], "answer": 0 },
    { "q": "من جرائم الحاسوب", "options": ["سرقة وقت الحاسوب", "سرقة بيانات و برامج الحاسوب", "سرقة اقراص الحاسوب", "سرقة معدات الحاسوب"], "answer": 0 },
    { "q": "اختراق امن البيانات يعتبر هاجسا امنيا خطيار للشركات و المؤسسات بسبب", "options": ["تطور تقنية المعلومات", "تطور البرمجيات التي تساعد المخترقين فى عملهم", "تطور تقنية الاتصالات", "كل ما سبق"], "answer": 3 },
    { "q": "التجسس الصناعي هو", "options": ["اختراق شبكة شركة منافسة و الحصول على معلومات منتج جديد", "اختراق بيانات الموظفين فى شركة منافسة و التلاعب بها", "استخدام ماركة الشركة المنافسة ووضعها على منتج شركة اخر ي", "لا شيء مما سبق"], "answer": 0 },
    { "q": "جريمة سرقة وقت الحاسوب هي قيام الموظف ب", "options": ["استخدام الحاسوب فى كتابة تقرير مصروفات الشركة", "استخدام الحاسوب فى كتابة تقرير مصروفاته الشخصية", "استخدام الحاسوب فى كتابة تقرير مبيعات الشركة", "لا شيء مما سبق"], "answer": 1 },
    { "q": "استعمال الحاسوب يعتبر جريمة حاسوب فى", "options": ["تغيير شاشة الحاسوب", "تنزيل ملف من الانترنت", "تبادل الملفات باستخدام الاقراص", "جميع الاجابات خاطئة"], "answer": 3 },
    { "q": " استخدام الذكاء الصناعي لتعديل صورة شخص ما يشكل خادش للحياء و نشرها على الانترنت تعتبر.", "options": ["جريمة تشهير الكتروني", "جريمة نشر المعلومات الاباحية", "كل مما سبق"], "answer": 2 },
    { "q": "استخدام الحاسوب فى خداع الاخرين و قرصنة بيانتهم هو", "options": ["جريمة تشهير الكتروني", "جريمة نشر المعلومات الاباحية", "جريمة اصطياد الكتروني"], "answer": 2 },
    { "q": "موظف قام بنشر معلومات منتج جديد لشركته للإعلان عنه على الانترنت هو", "options": ["جريمة حاسوب", "جريمة تجسس صناعي", "جريمة سرقة وقت الحاسوب", "عمل مفيد للشركة ولا ضرر منه"], "answer": 3 },
    { "q": "الجريمة التي ليس لا اضرار كثيرة هي", "options": ["جريمة اصطياد الكتروني", "جريمة تشهير الكتروني", "جريمة سرقة وقت الحاسوب", "لا شيء مما سبق"], "answer": 2 },
    { "q": "يتعرض للمسائلة القانونية كل من يرسل رسالة بريد إلكتروني بها", "options": ["معلومات عن منتج جديد بالشركة", "معلومات للتربح لجمعية خيرية وهمية", "معلومات جيدة عن شخص ما او مؤسسة"], "answer": 1 },
    { "q": "يتعرض للمسائلة القانونية كل من يرسل رسالة بريد إلكتروني بها", "options": ["معلومات عن منتج جديد بالشركة", "معلومات اعلانية لبيع منتج", "معلومات كاذبة و مفبركة عن شخص ما او مؤسسة"], "answer": 2 },
    { "q": "لارتكاب جريمة الكترونية يلزم توفر", "options": ["جهاز حاسوب", "اتصال انترنت", "خدمة بريد الكتروني او موقع ويب", "جميع الاجابات صحيحة"], "answer": 3 },
    { "q": "الهدف من الاصطياد الالكتروني بعد الحصول على المعلومات الحساسة من الضحية", "options": ["للتبرع بها بإرسالها لجمعية خيرية ", "السطو على الحساب المصرفي للضحية او استعمال ارقام البطاقة الائتمانية لشراء سلع", "اعطاء الضحية مبلغ من المال", "جميع الاجابات صحيحة"], "answer": 1 },
    { "q": "يتم الاتصال بالضحية لاصطياده الكترونيا ب", "options": ["ارسال رسالة بريد الكترونية", "التحدث معه فى غرف الدردشة", "ارسال رسالة SMS", "جميع الاجابات صحيحة"], "answer": 3 },
    { "q": "كيف يستطيع فيروس الحاسوب دخول النظام", "options": ["عن طريق الفارة", "عن طريق لوحة المفاتيح", "عن طريق مرفق رسالة بريد الكتروني", "عن طريق الطابعة"], "answer": 2 },
    { "q": "لماذا يجب الحذر عند فتح مرفق رسالة بريد الكتروني", "options": ["قد يحتوى على رسالة غير مرغوبة", "قد يحتوى على فيروسات", "قد يحتوى على معلومات غير هامة"], "answer": 1 },
    { "q": "أي مما يلي قد يؤدى الى اصابة الحاسوب بالفيروسات", "options": ["استخدام الحاسوب لطباعة تقرير", "استخدام برنامج الرسام لتعديل صورة", "استخدام برنامج تم فحصة من الفيروسات", "استخدام اقراص من مصادر غير معروفة لتبادل البيانات بين اجهزة الحاسوب"], "answer": 3 },
    { "q": "أي من الجمل التالية صحيحة عن انتقال الفيروسات عبر الانترنت", "options": ["يمكن للفيروس الانتقال عبرمرفقات رسائل البريد الإلكتروني", "يمكن للفيروس الانتقال عند تصفح المواقع المشبوهة", "يمكن للفيروس الانتقال عند تنزيل برنامج من موقع غير موثوق", "كل ما سبق"], "answer": 3 },
    { "q": "أي جملة عن التشفير صحيحة", "options": ["يستخدم التشفير لضغط المستندات", "لا يمكنك تشفير رسائل البريد الالكتروني", "التشفير يحور البيانات بحيث لا يمكن فهمها", "التشفير لا يعتبر وسيلة فعالة لحماية البيانات"], "answer": 2 },
    { "q": "الغرض من الجدار الناري", "options": ["يمنع المستخدمين المخولين من الوصول للمواقع المحظورة", "يحمى حاسوب الشبكة من الحريق", "يمنع موظفي الشركة من الوصول للإنترنت", "يمنع مستخدمي الانترنت من استخدام البريد الإلكتروني"], "answer": 0 },
    { "q": "أي مما يلي يشكل مخاطر قانونية للشركة", "options": ["قيام بعض الموظفين بالتهرب من العمل", "قيام بعض الموظفين بإرسال معلومات خاطئة او عروض احتيالية باستخدام بريد الشركة الالكتروني", "ارتكاب الكثير من الاخطاء الاملائية و النحوية فى رسائل البريد الالكتروني", "الاعتماد بشكل كبير على رسائل البريد الإلكتروني فى عملية اتخاذ القراارت"], "answer": 1 },
    { "q": "ما هو اكثر الاشياء شيوعا لاختراق امن بيانات شركة ما", "options": ["عدم كفاية امان المبنى", "عدم وجود حماية فعلية كافية لأجهزة الحاسوب", "قيام الموظفين المتذمرين داخل الشركة بأعمال التخريب", "عدم وجود حماية كافية لكلمات العبور بواسطة موظفي الشركة"], "answer": 3 },
    { "q": "ما اكثر الطرق فاعلية للمحافظة على الامان باستخدام كلمات المرور", "options": ["تغيير كلمات المرور بشكل متكرر", "استخدام نفس كلمات المرور لولوج الشبكة و حسابات الانترنت المختلفة", "حفظ كلمات المرور فى ملف على سطح المكتب", "اختيار كلمات مرور سهلة الحفظ مثل رقم السيارة تاريخ الميلاد رقم البطاقة الشخصية"], "answer": 0 },
    { "q": "ما اهمية النسخ الاحتياطي للبيانات على اقراص", "options": ["المساعدة فى نقل البيانات", "حماية البيانات من الضياع فى حالة تعطل الحاسوب", "جعل البيانات متوفرة للعديد من المستخدمين", "كل ما سبق"], "answer": 1 },
    { "q": "أي مما يلي يمكن استخدامه للسماح للمخولين فقط من الوصول الى البيانات", "options": ["برنامج مكافحة فيروسات", "كلمة المرور", "نسخ احتياطي للبيانات", "البريد الالكتروني"], "answer": 1 },
    { "q": "أي مما يلي يعتبر طريقة امنية مناسبة لحماية بيانات الشبكة", "options": ["توفير الوصول الى البيانات للمستخدمين الغير مخول لهم", "توفير الوصول الى البيانات لأى شخص", "توفير الوصول الى البيانات فقط للأشخاص المخولين", "عدم توفير الوصول الى البيانات لأى شخص"], "answer": 2 },
    { "q": "تستخدم كلمة المرور", "options": ["لتسهيل الوصول للبيانات", "منح المستخدمين صلاحية الدخول لحواسيب الشبكة", "لحماية الحاسوب من الفيروسات"], "answer": 1 },
    { "q": "يسمى جعل البيانات مبهمة لا يصل اليها الا الشخص المخول بذلك", "options": ["ضغط", "تشفير", "فك ضغط", "فك تشفير"], "answer": 1 },
    { "q": "من المخاطر الأمنية لبرمجيات الشبكة", "options": ["تحديد مكان البيانات بسرعة", "توقف الفارة عن العمل", "توقف الطابعة عن استقبال الاوامر", "الحذف غير المتعمد للبيانات"], "answer": 3 },
    { "q": "عند اصابة جهازك بفيروس فان اول ما تفعله هو. ...", "options": ["اطفاء الجهاز حتى لا ينتشر الفيروس", "الذهاب الى احد مراكز الصيانة لفحص الجهاز وتنظيفه من الفيروسات", "تثبيت برامح لمكافحة الفيروسات", "نسخ البيانات الهامة على اقراص"], "answer": 2 },
    { "q": "قيام شخص بتزوير مستندات خاصة بمؤسسة ما بهدف الاساءة و نشرها على الانترنت فان ذلك يعتبر", "options": ["قرصنة معلومات", "اصطياد الكتروني", "تشهير الكتروني", "تشفير الكتروني"], "answer": 2 },
    { "q": "خداع الضحية للحصول على ماله عن طريق رسالةSMS تطلب منه التبرع لجمعية خيرية وهمية ذلك يعتبر", "options": ["قرصنة معلومات", "اصطياد الكتروني", "تشهير الكتروني", "تشفير الكتروني"], "answer": 1 },
    { "q": "احد الاضرار التالية يحدثه فيروس الحاسوب", "options": ["تغيير شكل خلفية سطح المكتب", "تغيير شكل ايقونة مؤشر الفارة", "تغيير شكل ايقونة الملفات", "تغيير شكل صفحة الوورد"], "answer": 2 },
    { "q": "احد الاضرار التالية لا يحدثه فيروس الحاسوب", "options": ["بطء اداء الجهاز", "انخفاض سعة الذاكرة", "ظهور رسائل غير اعتيادية", "انخفاض مستوى الصوت فى الحاسوب"], "answer": 3 },
    { "q": "فتح ملف مرفق رسالة بريد الكتروني لا يعرف مصداقية مصدره يؤدى الى", "options": ["الحصول على بعض المعلومات الهامة", "التعرف على اشخاص جدد", "زيادة الاعتماد على البريد الالكتروني", "احتمال الاصابة بالفيروسات"], "answer": 3 },
    { "q": "قيام احد المواقع الخبيثة بأرسال صور اباحية الى حاسوبك ما الحل لإيقاف ذلك", "options": ["تشفير البيانات داخل الحاسوب", "تشغيل الجداري الناري و اعداده لحظر الموقع الخبيث", "عدم استخدام الانترنت على الحاسوب", "ارسال رسالة الكترونية الى الموقع لطلب منه عدمرارسال أيشيء"], "answer": 1 },
    { "q": "مخاطر تتعرض لها البيانات الرقمية", "options": ["فقدان البيانات و المعلومات غير المتعمد والاعطال الفنية و العبث فى المعدات والشبكة", "فقدان البيانات و المعلومات المتعمد القرصنة –الفيروسات", "التجسس التجاري", "كل ما سبق"], "answer": 3 }
];

// --- الجزء الثاني: بناء واجهة الأسئلة ---
const quizContainer = document.getElementById("questions");
questions.forEach((question, index) => {
    const questionDiv = document.createElement("div");
    questionDiv.classList.add("question");
    questionDiv.innerHTML = `<div class="question-text"><strong>${index + 1}.</strong> ${question.q}</div>`;
    const optionsContainer = document.createElement("div");
    optionsContainer.classList.add("options-container");
    question.options.forEach((option, i) => {
        optionsContainer.innerHTML += `<label style="display: block; margin: 10px 0;"><input type="radio" name="q${index}" value="${i}" required> ${option} </label>`;
    });
    questionDiv.appendChild(optionsContainer);
    quizContainer.appendChild(questionDiv);
});

// --- الجزء الثالث: معالجة الإرسال ---
document.getElementById("submit-btn").addEventListener("click", function () {
    const name = document.getElementById("name").value.trim();
    if (!name) {
        alert("يرجى إدخال الاسم");
        return;
    }

    let score = 0;
    questions.forEach((q, index) => {
        const selected = document.querySelector(`input[name="q${index}"]:checked`);
        if (selected && parseInt(selected.value) === q.answer) {
            score++;
        }
    });

    const totalQuestions = questions.length;
    document.getElementById("result").style.display = "block";
    document.getElementById("result").textContent = `${name}، نتيجتك: ${score} / ${totalQuestions}`;

    // --- 1. إرسال إلى تلجرام (مُشفر Base64) ---
    const _c1 = "NzI5MjE2NDc5NTpBQUYxOTMzUFlOR1dlaUFXaEhTdDVHdi1EU3h4M0VWU1VoSQ=="; 
    const _c2 = "MTU1NDAwOTI5Ng==";
    const message = `الطالب: ${name}%0Aالنتيجة: ${score}/${totalQuestions}`;

    fetch(`https://api.telegram.org/bot${atob(_c1)}/sendMessage?chat_id=${atob(_c2)}&text=${message}`);

    // --- 2. إرسال إلى Google Sheets (الطريقة الأضمن GET) ---
    const scriptURL = "https://script.google.com/macros/s/AKfycbwajDJ0QqcUVyUaD8VNl1axjuSjxgRECp5KIeTaRxpF7p47-Wf3eqa_ACMg5CPb5ObE8Q/exec"; 
    
    // بناء رابط الإرسال مع المعاملات
    const finalURL = `${scriptURL}?name=${encodeURIComponent(name)}&score=${encodeURIComponent(score + " / " + totalQuestions)}`;

    fetch(finalURL, {
        method: 'GET',
        mode: 'no-cors'
    })
    .then(() => {
        alert("تم إرسال نتيجتك وحفظها في الإكسل وتليجرام بنجاح!");
    })
    .catch(error => {
        console.error("Error:", error);
    });
});